michalnand/motoko_uprising_new/src/firmware/STM32F7xx_StdPeriph_Driver/src/stm32f7xx_sdmmc.c

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_sdmmc.h"
#include "stm32f7xx_rcc.h"

/** @addtogroup STM32F7xx_StdPeriph_Driver
  * @{
  */

/** @defgroup SDMMC 
  * @brief SDMMC driver modules
  * @{
  */ 

/* ---------------------- SDMMC registers bit mask ------------------------ */
/* --- CLKCR Register ---*/
/* CLKCR register clear mask */
#define CLKCR_CLEAR_MASK         ((uint32_t)(SDMMC_CLKCR_CLKDIV  | SDMMC_CLKCR_PWRSAV |\
                                             SDMMC_CLKCR_BYPASS  | SDMMC_CLKCR_WIDBUS |\
                                             SDMMC_CLKCR_NEGEDGE | SDMMC_CLKCR_HWFC_EN))
//#define CLKCR_CLEAR_MASK         ((uint32_t)0xFFFF8100) 
/* --- PWRCTRL Register ---*/
/* SDMMC PWRCTRL Mask */
//#define PWR_PWRCTRL_MASK         ((uint32_t)0xFFFFFFFC)

/* --- DCTRL Register ---*/
/* SDMMC DCTRL Clear Mask */
#define DCTRL_CLEAR_MASK         ((uint32_t)(SDMMC_DCTRL_DTEN    | SDMMC_DCTRL_DTDIR |\
                                             SDMMC_DCTRL_DTMODE  | SDMMC_DCTRL_DBLOCKSIZE))
//#define DCTRL_CLEAR_MASK         ((uint32_t)0xFFFFFF08)

/* --- CMD Register ---*/
/* CMD Register clear mask */
#define CMD_CLEAR_MASK           ((uint32_t)(SDMMC_CMD_CMDINDEX | SDMMC_CMD_WAITRESP |\
                                             SDMMC_CMD_WAITINT  | SDMMC_CMD_WAITPEND |\
                                             SDMMC_CMD_CPSMEN   | SDMMC_CMD_SDIOSUSPEND))
//#define CMD_CLEAR_MASK           ((uint32_t)0xFFFFF800)

/* SDMMC RESP Registers Address */
//#define SDMMC_RESP_ADDR           ((uint32_t)(SDMMC_BASE + 0x14))

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup SDMMC_Private_Functions
  * @{
  */

/** @defgroup SDMMC_Group1 Initialization and Configuration functions
 *  @brief   Initialization and Configuration functions 
 *
@verbatim   
 ===============================================================================
              ##### Initialization and Configuration functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Deinitializes the SDMMC peripheral registers to their default reset values.
  * @param  None
  * @retval None
  */
void SDMMC_DeInit(SDMMC_TypeDef *SDMMCx)
{
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  
  if(SDMMCx == SDMMC1)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDMMC1, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDMMC1, DISABLE);
  }
}

/**
  * @brief  Initializes the SDMMC peripheral according to the specified 
  *         parameters in the SDMMC_InitStruct.
  * @param  SDMMC_InitStruct : pointer to a SDMMC_InitTypeDef structure 
  *         that contains the configuration information for the SDMMC peripheral.
  * @retval None
  */
void SDMMC_Init(SDMMC_TypeDef *SDMMCx, SDMMC_InitTypeDef* SDMMC_InitStruct)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  assert_param(IS_SDMMC_CLOCK_EDGE(SDMMC_InitStruct->SDMMC_ClockEdge));
  assert_param(IS_SDMMC_CLOCK_BYPASS(SDMMC_InitStruct->SDMMC_ClockBypass));
  assert_param(IS_SDMMC_CLOCK_POWER_SAVE(SDMMC_InitStruct->SDMMC_ClockPowerSave));
  assert_param(IS_SDMMC_BUS_WIDE(SDMMC_InitStruct->SDMMC_BusWide));
  assert_param(IS_SDMMC_HARDWARE_FLOW_CONTROL(SDMMC_InitStruct->SDMMC_HardwareFlowControl)); 
   
/*---------------------------- SDMMC CLKCR Configuration ------------------------*/  
  /* Get the SDMMC CLKCR value */
  //tmpreg = SDMMCx->CLKCR;
  
  /* Clear CLKDIV, PWRSAV, BYPASS, WIDBUS, NEGEDGE, HWFC_EN bits */
  //tmpreg &= CLKCR_CLEAR_MASK;
  
  /* Set CLKDIV bits according to SDMMC_ClockDiv value */
  /* Set PWRSAV bit according to SDMMC_ClockPowerSave value */
  /* Set BYPASS bit according to SDMMC_ClockBypass value */
  /* Set WIDBUS bits according to SDMMC_BusWide value */
  /* Set NEGEDGE bits according to SDMMC_ClockEdge value */
  /* Set HWFC_EN bits according to SDMMC_HardwareFlowControl value */
  tmpreg |= (SDMMC_InitStruct->SDMMC_ClockDiv  | SDMMC_InitStruct->SDMMC_ClockPowerSave |
             SDMMC_InitStruct->SDMMC_ClockBypass | SDMMC_InitStruct->SDMMC_BusWide |
             SDMMC_InitStruct->SDMMC_ClockEdge | SDMMC_InitStruct->SDMMC_HardwareFlowControl); 
  
  /* Write to SDMMC CLKCR */
  //SDMMCx->CLKCR = tmpreg;
  MODIFY_REG(SDMMCx->CLKCR, CLKCR_CLEAR_MASK, tmpreg);
}

/**
  * @brief  Fills each SDMMC_InitStruct member with its default value.
  * @param  SDMMC_InitStruct: pointer to an SDMMC_InitTypeDef structure which 
  *         will be initialized.
  * @retval None
  */
void SDMMC_StructInit(SDMMC_InitTypeDef* SDMMC_InitStruct)
{
  /* SDMMC_InitStruct members default value */
  SDMMC_InitStruct->SDMMC_ClockDiv = 0x00;
  SDMMC_InitStruct->SDMMC_ClockEdge = SDMMC_ClockEdge_Rising;
  SDMMC_InitStruct->SDMMC_ClockBypass = SDMMC_ClockBypass_Disable;
  SDMMC_InitStruct->SDMMC_ClockPowerSave = SDMMC_ClockPowerSave_Disable;
  SDMMC_InitStruct->SDMMC_BusWide = SDMMC_BusWide_1b;
  SDMMC_InitStruct->SDMMC_HardwareFlowControl = SDMMC_HardwareFlowControl_Disable;
}

/**
  * @brief  Enables or disables the SDMMC Clock.
  * @param  NewState: new state of the SDMMC Clock. 
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDMMC_ClockCmd(SDMMC_TypeDef *SDMMCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if( NewState != DISABLE )
  {
    SDMMCx->CLKCR |= SDMMC_CLKCR_CLKEN;
  }
  else
  {
    SDMMCx->CLKCR &= ~SDMMC_CLKCR_CLKEN;
  }
  
}

/**
  * @brief  Sets the power status of the controller.
  * @param  SDMMC_PowerState: new state of the Power state. 
  *          This parameter can be one of the following values:
  *            @arg SDMMC_PowerState_OFF: SDMMC Power OFF
  *            @arg SDMMC_PowerState_ON: SDMMC Power ON
  * @retval None
  */
void SDMMC_SetPowerState(SDMMC_TypeDef *SDMMCx, uint32_t SDMMC_PowerState)
{
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  assert_param(IS_SDMMC_POWER_STATE(SDMMC_PowerState));
  
  SDMMCx->POWER = SDMMC_PowerState;
}

/**
  * @brief  Gets the power status of the controller.
  * @param  None
  * @retval Power status of the controller. The returned value can be one of the 
  *         following values:
  *            - 0x00: Power OFF
  *            - 0x02: Power UP
  *            - 0x03: Power ON 
  */
uint32_t SDMMC_GetPowerState(SDMMC_TypeDef *SDMMCx)
{
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  
  return (SDMMCx->POWER & SDMMC_POWER_PWRCTRL);
}

/**
  * @}
  */

