michalnand/motoko_uprising_new/src/firmware/STM32F7xx_StdPeriph_Driver/src/stm32f7xx_sdmmc.c
/** @defgroup SDMMC_Group2 Command path state machine (CPSM) management functions
 *  @brief   Command path state machine (CPSM) management functions 
 *
@verbatim   
 ===============================================================================
        ##### Command path state machine (CPSM) management functions #####
 ===============================================================================  

  This section provide functions allowing to program and read the Command path 
  state machine (CPSM).

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the SDMMC Command according to the specified 
  *         parameters in the SDMMC_CmdInitStruct and send the command.
  * @param  SDMMC_CmdInitStruct : pointer to a SDMMC_CmdInitTypeDef 
  *         structure that contains the configuration information for the SDMMC 
  *         command.
  * @retval None
  */
void SDMMC_SendCommand(SDMMC_TypeDef *SDMMCx, SDMMC_CmdInitTypeDef *SDMMC_CmdInitStruct)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  assert_param(IS_SDMMC_CMD_INDEX(SDMMC_CmdInitStruct->SDMMC_CmdIndex));
  assert_param(IS_SDMMC_RESPONSE(SDMMC_CmdInitStruct->SDMMC_Response));
  assert_param(IS_SDMMC_WAIT(SDMMC_CmdInitStruct->SDMMC_Wait));
  assert_param(IS_SDMMC_CPSM(SDMMC_CmdInitStruct->SDMMC_CPSM));
  
/*---------------------------- SDMMC ARG Configuration ------------------------*/
  /* Set the SDMMC Argument value */
  SDMMCx->ARG = SDMMC_CmdInitStruct->SDMMC_Argument;
  
/*---------------------------- SDMMC CMD Configuration ------------------------*/  
  /* Get the SDMMC CMD value */
  //tmpreg = SDMMCx->CMD;
  /* Clear CMDINDEX, WAITRESP, WAITINT, WAITPEND, CPSMEN bits */
  //tmpreg &= CMD_CLEAR_MASK;
  
  /* Set CMDINDEX bits according to SDMMC_CmdIndex value */
  /* Set WAITRESP bits according to SDMMC_Response value */
  /* Set WAITINT and WAITPEND bits according to SDMMC_Wait value */
  /* Set CPSMEN bits according to SDMMC_CPSM value */
  tmpreg |= (uint32_t)SDMMC_CmdInitStruct->SDMMC_CmdIndex | SDMMC_CmdInitStruct->SDMMC_Response
           | SDMMC_CmdInitStruct->SDMMC_Wait | SDMMC_CmdInitStruct->SDMMC_CPSM;
  
  /* Write to SDMMC CMD */
  //SDMMCx->CMD = tmpreg;
  MODIFY_REG(SDMMCx->CMD, CMD_CLEAR_MASK, tmpreg); 
}

/**
  * @brief  Fills each SDMMC_CmdInitStruct member with its default value.
  * @param  SDMMC_CmdInitStruct: pointer to an SDMMC_CmdInitTypeDef 
  *         structure which will be initialized.
  * @retval None
  */
void SDMMC_CmdStructInit(SDMMC_CmdInitTypeDef* SDMMC_CmdInitStruct)
{
  /* SDMMC_CmdInitStruct members default value */
  SDMMC_CmdInitStruct->SDMMC_Argument = 0x00;
  SDMMC_CmdInitStruct->SDMMC_CmdIndex = 0x00;
  SDMMC_CmdInitStruct->SDMMC_Response = SDMMC_Response_No;
  SDMMC_CmdInitStruct->SDMMC_Wait = SDMMC_Wait_No;
  SDMMC_CmdInitStruct->SDMMC_CPSM = SDMMC_CPSM_Disable;
}

/**
  * @brief  Returns command index of last command for which response received.
  * @param  None
  * @retval Returns the command index of the last command response received.
  */
uint8_t SDMMC_GetCommandResponse(SDMMC_TypeDef *SDMMCx)
{
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  
  return (uint8_t)(SDMMCx->RESPCMD);
}

/**
  * @brief  Returns response received from the card for the last command.
  * @param  SDMMC_RESP: Specifies the SDMMC response register. 
  *          This parameter can be one of the following values:
  *            @arg SDMMC_RESP1: Response Register 1
  *            @arg SDMMC_RESP2: Response Register 2
  *            @arg SDMMC_RESP3: Response Register 3
  *            @arg SDMMC_RESP4: Response Register 4
  * @retval The Corresponding response register value.
  */
uint32_t SDMMC_GetResponse(SDMMC_TypeDef *SDMMCx, uint32_t SDMMC_RESP)
{
  __IO uint32_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  assert_param(IS_SDMMC_RESP(SDMMC_RESP));

  tmp = (uint32_t)&(SDMMCx->RESP1) + SDMMC_RESP;
  
  return (*(__IO uint32_t *) tmp); 
}

/**
  * @}
  */

/** @defgroup SDMMC_Group3 Data path state machine (DPSM) management functions
 *  @brief   Data path state machine (DPSM) management functions
 *
@verbatim   
 ===============================================================================
         ##### Data path state machine (DPSM) management functions #####
 ===============================================================================  

  This section provide functions allowing to program and read the Data path 
  state machine (DPSM).

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the SDMMC data path according to the specified 
  *         parameters in the SDMMC_DataInitStruct.
  * @param  SDMMC_DataInitStruct : pointer to a SDMMC_DataInitTypeDef structure 
  *         that contains the configuration information for the SDMMC command.
  * @retval None
  */
void SDMMC_DataConfig(SDMMC_TypeDef *SDMMCx, SDMMC_DataInitTypeDef* SDMMC_DataInitStruct)
{
  uint32_t tmpreg = 0;
  
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  assert_param(IS_SDMMC_DATA_LENGTH(SDMMC_DataInitStruct->SDMMC_DataLength));
  assert_param(IS_SDMMC_BLOCK_SIZE(SDMMC_DataInitStruct->SDMMC_DataBlockSize));
  assert_param(IS_SDMMC_TRANSFER_DIR(SDMMC_DataInitStruct->SDMMC_TransferDir));
  assert_param(IS_SDMMC_TRANSFER_MODE(SDMMC_DataInitStruct->SDMMC_TransferMode));
  assert_param(IS_SDMMC_DPSM(SDMMC_DataInitStruct->SDMMC_DPSM));

/*---------------------------- SDMMC DTIMER Configuration ---------------------*/
  /* Set the SDMMC Data TimeOut value */
  SDMMCx->DTIMER = SDMMC_DataInitStruct->SDMMC_DataTimeOut;

/*---------------------------- SDMMC DLEN Configuration -----------------------*/
  /* Set the SDMMC DataLength value */
  SDMMCx->DLEN = SDMMC_DataInitStruct->SDMMC_DataLength;

/*---------------------------- SDMMC DCTRL Configuration ----------------------*/  
  /* Get the SDMMC DCTRL value */
  //tmpreg = SDMMCx->DCTRL;
  /* Clear DEN, DTMODE, DTDIR and DBCKSIZE bits */
  //tmpreg &= DCTRL_CLEAR_MASK;
  /* Set DEN bit according to SDMMC_DPSM value */
  /* Set DTMODE bit according to SDMMC_TransferMode value */
  /* Set DTDIR bit according to SDMMC_TransferDir value */
  /* Set DBCKSIZE bits according to SDMMC_DataBlockSize value */
  tmpreg |= (uint32_t)SDMMC_DataInitStruct->SDMMC_DataBlockSize | SDMMC_DataInitStruct->SDMMC_TransferDir
           | SDMMC_DataInitStruct->SDMMC_TransferMode | SDMMC_DataInitStruct->SDMMC_DPSM;

  /* Write to SDMMC DCTRL */
  //SDMMCx->DCTRL = tmpreg;
  MODIFY_REG(SDMMCx->DCTRL, DCTRL_CLEAR_MASK, tmpreg);
}

/**
  * @brief  Fills each SDMMC_DataInitStruct member with its default value.
  * @param  SDMMC_DataInitStruct: pointer to an SDMMC_DataInitTypeDef structure 
  *         which will be initialized.
  * @retval None
  */
void SDMMC_DataStructInit(SDMMC_DataInitTypeDef* SDMMC_DataInitStruct)
{
  /* SDMMC_DataInitStruct members default value */
  SDMMC_DataInitStruct->SDMMC_DataTimeOut = 0xFFFFFFFF;
  SDMMC_DataInitStruct->SDMMC_DataLength = 0x00;
  SDMMC_DataInitStruct->SDMMC_DataBlockSize = SDMMC_DataBlockSize_1b;
  SDMMC_DataInitStruct->SDMMC_TransferDir = SDMMC_TransferDir_ToCard;
  SDMMC_DataInitStruct->SDMMC_TransferMode = SDMMC_TransferMode_Block;  
  SDMMC_DataInitStruct->SDMMC_DPSM = SDMMC_DPSM_Disable;
}

/**
  * @brief  Returns number of remaining data bytes to be transferred.
  * @param  None
  * @retval Number of remaining data bytes to be transferred
  */
uint32_t SDMMC_GetDataCounter(SDMMC_TypeDef *SDMMCx)
{
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  
  return SDMMCx->DCOUNT;
}

/**
  * @brief  Read one data word from Rx FIFO.
  * @param  None
  * @retval Data received
  */
uint32_t SDMMC_ReadData(SDMMC_TypeDef *SDMMCx)
{
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  
  return SDMMCx->FIFO;
}

/**
  * @brief  Write one data word to Tx FIFO.
  * @param  Data: 32-bit data word to write.
  * @retval None
  */
void SDMMC_WriteData(SDMMC_TypeDef *SDMMCx, uint32_t Data)
{
  /* Check the parameters */
  assert_param(IS_SDMMC_ALL_INSTANCE(SDMMCx));
  
